In [1]:
import numpy as np
import pandas as pd

In [5]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [6]:
df = pd.DataFrame(d)

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
# dropna or drop null aka nan method

In [9]:
df.dropna() # () by itself will drop nan rows as default axis = 0, and df.dropna(axis=1) will do same to cols

     A    B  C
0  1.0  5.0  1

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [12]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
# you can specify a threshold

In [14]:
df.dropna(thresh=2) #use shift+tab for the docstring

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [15]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
# to fill in nan or missing null data

In [17]:
df.fillna(value='BLANK')

       A      B  C
0      1      5  1
1      2  BLANK  2
2  BLANK  BLANK  3

In [18]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
# fill nan with mean value of the column

In [20]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [21]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64